In [1]:
import sqlite3

In [2]:
##connect to an SQLte database
connection=sqlite3.connect('example.db')
connection

In [3]:
#creating a cursor so that we can operate on database
cursor=connection.cursor()

In [4]:
# create  table
cursor.execute('''
Create table If Not Exists employees(id INteger Primary Key,
                name Text Not NULL,
               age Integer,
               department Text)''')
#commit the changes
connection.commit()

In [5]:
# create  table
cursor.execute('''
select * from employees''')

In [6]:
#insert data to sqlite table
cursor.execute('''
insert into employees values (001,'Sarvjeet',32,'Engineer'),
               (002,'Somu',23,'accountant'),
               (003,'rajat',98,'ceo'),
               (004,'rockey',56,'manager')''')
connection.commit()

IntegrityError: UNIQUE constraint failed: employees.id

In [ ]:
# Query the adat from table
cursor.execute('''
select * from employees''')
rows=cursor.fetchall()
#printing the query data
for row in rows:
    print(row)

(1, 'Sarvjeet', 32, 'Engineer')
(2, 'Somu', 23, 'accountant')
(3, 'rajat', 98, 'ceo')
(4, 'rockey', 56, 'manager')

In [ ]:
#update  data in table
cursor.execute('''
Update employees 
set name='Shyam'
where name='Somu' ''')
connection.commit()

In [ ]:
# Query the adat from table
cursor.execute('''
select * from employees''')
rows=cursor.fetchall()
#printing the query data
for row in rows:
    print(row)

(1, 'Sarvjeet', 32, 'Engineer')
(2, 'Shyam', 23, 'accountant')
(3, 'rajat', 98, 'ceo')
(4, 'rockey', 56, 'manager')

In [ ]:
#Delete data from table
cursor.execute(''' delete from employees where name='rajat' ''')
connection.commit()

In [ ]:
# Query the adat from table
cursor.execute('''
select * from employees''')
rows=cursor.fetchall()
#printing the query data
for row in rows:
    print(row)

(1, 'Sarvjeet', 32, 'Engineer')
(2, 'Shyam', 23, 'accountant')
(4, 'rockey', 56, 'manager')

# working with sales data

In [8]:
import sqlite3
connection=sqlite3.connect('sales_data.db')
cursor=connection.cursor()
cursor.execute('''create table if not exists sales (
               id integer primary key,
               date text Not NUll,
               product text not null,
               sales integer,region text)''')
connection.commit()

In [19]:


#to execute many command
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]
cursor.executemany('''insert into sales(date,product,sales,region) values(?,?,?,?)''',sales_data)
connection.commit()

In [20]:
# Query the adat from table
cursor.execute('''
select * from sales''')
rows=cursor.fetchall()
#printing the query data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')
(6, '2023-01-01', 'Product1', 100, 'North')
(7, '2023-01-02', 'Product2', 200, 'South')
(8, '2023-01-03', 'Product1', 150, 'East')
(9, '2023-01-04', 'Product3', 250, 'West')
(10, '2023-01-05', 'Product2', 300, 'North')
(11, '2023-01-01', 'Product1', 100, 'North')
(12, '2023-01-02', 'Product2', 200, 'South')
(13, '2023-01-03', 'Product1', 150, 'East')
(14, '2023-01-04', 'Product3', 250, 'West')
(15, '2023-01-05', 'Product2', 300, 'North')
(16, '2023-01-01', 'Product1', 100, 'North')
(17, '2023-01-02', 'Product2', 200, 'South')
(18, '2023-01-03', 'Product1', 150, 'East')
(19, '2023-01-04', 'Product3', 250, 'West')
(20, '2023-01-05', 'Product2', 300, 'North')

In [21]:
#to close the connection
connection.close()